package CH11EXEC;

public class C02ArrayPrac {

	public static void main(String[] args) {
		//문제
		//5명의 학생의 국/영/수 점수를 입력받아 출력을 해봅시다
		//이차원배열
		//int score[5][3]
		//반복문을 이용해서 값을 입력받ㄷ기
		//각 행의 합 과 전체 합 // 각행의 평균 전체 평균을 출력하세요
		//출력에
		//1 학생 점수입력(국/영/수 순서) : 100 70 60
		//2 학생 점수입력(국/영/수 순서) : 99 98 66
		//3 학생 점수입력(국/영/수 순서) : 99 88 77
		//4 학생 점수입력(국/영/수 순서) : 100 55 66
		//5 학생 점수입력(국/영/수 순서) : 55 66 77
		//1 학생 총점 : ? 평균 ?
		//2 학생 총점 : ? 평균 ?
		//3 학생 총점 : ? 평균 ?
		//4 학생 총점 : ? 평균 ?
		//5 학생 총점 : ? 평균 ?
		//국어 총점 : ? 국어 평균 :?
		//영어 총점 : ? 국어 평균 :?
		//수학 총점 : ? 국어 평균 :?		
		
		

	}

}
